Repository: linagora/open-bastion
Catalog: debian/po/*.po
Languages: fr

source: PAM authentication mode for LemonLDAP::NG:
fr: Mode d'authentification PAM pour LemonLDAP::NG :

source: Choose how to configure PAM authentication:
fr: Choisissez comment configurer l'authentification PAM :

source: * none: Do not configure PAM automatically * mode-a: LLNG token only (strictest) * mode-b: LLNG token OR Unix password (fallback) * mode-c: SSH key with LLNG authorization only * mode-d: All methods (SSH keys, LLNG tokens, Unix passwords)
fr: * none : Ne pas configurer PAM automatiquement * mode-a : Token LLNG uniquement (le plus strict) * mode-b : Token LLNG OU mot de passe Unix (fallback) * mode-c : Clé SSH avec autorisation LLNG uniquement * mode-d : Toutes les méthodes (clés SSH, tokens LLNG, mots de passe Unix)

source: All modes require LLNG authorization to access this server.
fr: Tous les modes requièrent une autorisation LLNG pour accéder à ce serveur.

source: LemonLDAP::NG portal URL:
fr: URL du portail LemonLDAP::NG :

source: Enter the URL of your LemonLDAP::NG portal (e.g., https://auth.example.com).
fr: Entrez l'URL de votre portail LemonLDAP::NG (ex : https://auth.example.com).

source: OIDC client ID:
fr: Identifiant client OIDC :

source: Enter the OIDC client ID configured in LemonLDAP::NG for PAM access.
fr: Entrez l'identifiant client OIDC configuré dans LemonLDAP::NG pour l'accès PAM.

source: OIDC client secret:
fr: Secret client OIDC :

source: Enter the client secret for the OIDC client.
fr: Entrez le secret du client OIDC.

source: Server group name:
fr: Nom du groupe de serveurs :

source: Enter the server group name for authorization rules. This must match a group defined in LLNG's pamAccessServerGroups.
fr: Entrez le nom du groupe de serveurs pour les règles d'autorisation. Ce nom doit correspondre à un groupe défini dans pamAccessServerGroups de LLNG.

source: Configure PAM for sudo?
fr: Configurer PAM pour sudo ?

source: Set this to true if you want to configure /etc/pam.d/sudo with LLNG authentication. This allows using LLNG tokens for sudo commands.
fr: Activez cette option si vous souhaitez configurer /etc/pam.d/sudo avec l'authentification LLNG. Cela permet d'utiliser les tokens LLNG pour les commandes sudo.

source: Server group name for sudo:
fr: Nom du groupe de serveurs pour sudo :

source: Enter the server group name for sudo authorization rules.
fr: Entrez le nom du groupe de serveurs pour les règles d'autorisation sudo.

source: This allows different authorization rules for SSH access and sudo usage. Leave empty to use the same group as SSH.
fr: Cela permet d'avoir des règles d'autorisation différentes pour l'accès SSH et l'utilisation de sudo. Laissez vide pour utiliser le même groupe que SSH.
